tutorials/heatTransfer/chtMultiRegionFoam/externalCoupledHeater/system/bottomWater/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

U
{
    internalField   uniform (0.001 0 0);

    boundaryField
    {
        minX
        {
            type            fixedValue;
            value           uniform (0.001 0 0);
        }

        maxX
        {
            type            inletOutlet;
            inletValue      uniform (0 0 0);
        }

        ".*"
        {
            type            fixedValue;
            value           uniform (0 0 0);
        }
    }
}

T
{
    internalField   uniform 300;

    boundaryField
    {
        minX
        {
            type            fixedValue;
            value           uniform 300;
        }

        maxX
        {
            type            inletOutlet;
            inletValue      uniform 300;
        }

        ".*"
        {
            type            zeroGradient;
            value           uniform 300;
        }

        "bottomWater_to_.*"
        {
            type            compressible::turbulentTemperatureRadCoupledMixed;
            Tnbr            T;
            kappaMethod     fluidThermo;
            value           uniform 300;
        }
    }
}

epsilon
{
    internalField   uniform 0.01;

    boundaryField
    {
        minX
        {
            type            fixedValue;
            value           uniform 0.01;
        }

        maxX
        {
            type            inletOutlet;
            inletValue      uniform 0.01;
        }

        ".*"
        {
            type            epsilonWallFunction;
            value           uniform 0.01;
        }
    }
}

k
{
    internalField   uniform 0.1;

    boundaryField
    {
        minX
        {
            type            inletOutlet;
            inletValue      uniform 0.1;
        }

        maxX
        {
            type            zeroGradient;
            value           uniform 0.1;
        }

        ".*"
        {
            type            kqRWallFunction;
            value           uniform 0.1;
        }
    }
}

p_rgh
{
    internalField   uniform 0;

    boundaryField
    {
        minX
        {
            type            zeroGradient;
            value           uniform 0;
        }

        maxX
        {
            type            fixedValue;
            value           uniform 0;
        }

        ".*"
        {
            type            fixedFluxPressure;
            value           uniform 0;
        }
    }
}

p
{
    internalField   uniform 0;

    boundaryField
    {
        ".*"
        {
            type            calculated;
            value           uniform 0;
        }
    }
}


// ************************************************************************* //
